Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
/* -------- MCSPI_IER : (MCSPI Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define MCSPI_IER_RDRF_Pos                    _UINT32_(0)                                          /* (MCSPI_IER) Receive Data Register Full Interrupt Enable Position */
#define MCSPI_IER_RDRF_Msk                    (_UINT32_(0x1) << MCSPI_IER_RDRF_Pos)                /* (MCSPI_IER) Receive Data Register Full Interrupt Enable Mask */
#define MCSPI_IER_RDRF(value)                 (MCSPI_IER_RDRF_Msk & (_UINT32_(value) << MCSPI_IER_RDRF_Pos)) /* Assigment of value for RDRF in the MCSPI_IER register */
#define MCSPI_IER_TDRE_Pos                    _UINT32_(1)                                          /* (MCSPI_IER) MCSPI Transmit Data Register Empty Interrupt Enable Position */
#define MCSPI_IER_TDRE_Msk                    (_UINT32_(0x1) << MCSPI_IER_TDRE_Pos)                /* (MCSPI_IER) MCSPI Transmit Data Register Empty Interrupt Enable Mask */
#define MCSPI_IER_TDRE(value)                 (MCSPI_IER_TDRE_Msk & (_UINT32_(value) << MCSPI_IER_TDRE_Pos)) /* Assigment of value for TDRE in the MCSPI_IER register */
#define MCSPI_IER_MODF_Pos                    _UINT32_(2)                                          /* (MCSPI_IER) Mode Fault Error Interrupt Enable Position */
#define MCSPI_IER_MODF_Msk                    (_UINT32_(0x1) << MCSPI_IER_MODF_Pos)                /* (MCSPI_IER) Mode Fault Error Interrupt Enable Mask */
#define MCSPI_IER_MODF(value)                 (MCSPI_IER_MODF_Msk & (_UINT32_(value) << MCSPI_IER_MODF_Pos)) /* Assigment of value for MODF in the MCSPI_IER register */
#define MCSPI_IER_OVRES_Pos                   _UINT32_(3)                                          /* (MCSPI_IER) Overrun Error Interrupt Enable Position */
#define MCSPI_IER_OVRES_Msk                   (_UINT32_(0x1) << MCSPI_IER_OVRES_Pos)               /* (MCSPI_IER) Overrun Error Interrupt Enable Mask */
#define MCSPI_IER_OVRES(value)                (MCSPI_IER_OVRES_Msk & (_UINT32_(value) << MCSPI_IER_OVRES_Pos)) /* Assigment of value for OVRES in the MCSPI_IER register */
#define MCSPI_IER_ENDRX_Pos                   _UINT32_(4)                                          /* (MCSPI_IER) End of Receive Buffer Interrupt Enable Position */
#define MCSPI_IER_ENDRX_Msk                   (_UINT32_(0x1) << MCSPI_IER_ENDRX_Pos)               /* (MCSPI_IER) End of Receive Buffer Interrupt Enable Mask */
#define MCSPI_IER_ENDRX(value)                (MCSPI_IER_ENDRX_Msk & (_UINT32_(value) << MCSPI_IER_ENDRX_Pos)) /* Assigment of value for ENDRX in the MCSPI_IER register */
#define MCSPI_IER_ENDTX_Pos                   _UINT32_(5)                                          /* (MCSPI_IER) End of Transmit Buffer Interrupt Enable Position */
#define MCSPI_IER_ENDTX_Msk                   (_UINT32_(0x1) << MCSPI_IER_ENDTX_Pos)               /* (MCSPI_IER) End of Transmit Buffer Interrupt Enable Mask */
#define MCSPI_IER_ENDTX(value)                (MCSPI_IER_ENDTX_Msk & (_UINT32_(value) << MCSPI_IER_ENDTX_Pos)) /* Assigment of value for ENDTX in the MCSPI_IER register */
#define MCSPI_IER_RXBUFF_Pos                  _UINT32_(6)                                          /* (MCSPI_IER) Receive Buffer Full Interrupt Enable Position */
#define MCSPI_IER_RXBUFF_Msk                  (_UINT32_(0x1) << MCSPI_IER_RXBUFF_Pos)              /* (MCSPI_IER) Receive Buffer Full Interrupt Enable Mask */
#define MCSPI_IER_RXBUFF(value)               (MCSPI_IER_RXBUFF_Msk & (_UINT32_(value) << MCSPI_IER_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MCSPI_IER register */
#define MCSPI_IER_TXBUFE_Pos                  _UINT32_(7)                                          /* (MCSPI_IER) Transmit Buffer Empty Interrupt Enable Position */
#define MCSPI_IER_TXBUFE_Msk                  (_UINT32_(0x1) << MCSPI_IER_TXBUFE_Pos)              /* (MCSPI_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define MCSPI_IER_TXBUFE(value)               (MCSPI_IER_TXBUFE_Msk & (_UINT32_(value) << MCSPI_IER_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the MCSPI_IER register */
#define MCSPI_IER_NSSR_Pos                    _UINT32_(8)                                          /* (MCSPI_IER) NSS Rising Interrupt Enable Position */
#define MCSPI_IER_NSSR_Msk                    (_UINT32_(0x1) << MCSPI_IER_NSSR_Pos)                /* (MCSPI_IER) NSS Rising Interrupt Enable Mask */
#define MCSPI_IER_NSSR(value)                 (MCSPI_IER_NSSR_Msk & (_UINT32_(value) << MCSPI_IER_NSSR_Pos)) /* Assigment of value for NSSR in the MCSPI_IER register */
#define MCSPI_IER_TXEMPTY_Pos                 _UINT32_(9)                                          /* (MCSPI_IER) Transmission Registers Empty Enable Position */
#define MCSPI_IER_TXEMPTY_Msk                 (_UINT32_(0x1) << MCSPI_IER_TXEMPTY_Pos)             /* (MCSPI_IER) Transmission Registers Empty Enable Mask */
#define MCSPI_IER_TXEMPTY(value)              (MCSPI_IER_TXEMPTY_Msk & (_UINT32_(value) << MCSPI_IER_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the MCSPI_IER register */
#define MCSPI_IER_UNDES_Pos                   _UINT32_(10)                                         /* (MCSPI_IER) Underrun Error Interrupt Enable Position */
#define MCSPI_IER_UNDES_Msk                   (_UINT32_(0x1) << MCSPI_IER_UNDES_Pos)               /* (MCSPI_IER) Underrun Error Interrupt Enable Mask */
#define MCSPI_IER_UNDES(value)                (MCSPI_IER_UNDES_Msk & (_UINT32_(value) << MCSPI_IER_UNDES_Pos)) /* Assigment of value for UNDES in the MCSPI_IER register */
#define MCSPI_IER_CMP_Pos                     _UINT32_(11)                                         /* (MCSPI_IER) Comparison Interrupt Enable Position */
#define MCSPI_IER_CMP_Msk                     (_UINT32_(0x1) << MCSPI_IER_CMP_Pos)                 /* (MCSPI_IER) Comparison Interrupt Enable Mask */
#define MCSPI_IER_CMP(value)                  (MCSPI_IER_CMP_Msk & (_UINT32_(value) << MCSPI_IER_CMP_Pos)) /* Assigment of value for CMP in the MCSPI_IER register */
#define MCSPI_IER_CRCERR_Pos                  _UINT32_(13)                                         /* (MCSPI_IER) CRC Error Interrupt Enable Position */
#define MCSPI_IER_CRCERR_Msk                  (_UINT32_(0x1) << MCSPI_IER_CRCERR_Pos)              /* (MCSPI_IER) CRC Error Interrupt Enable Mask */
#define MCSPI_IER_CRCERR(value)               (MCSPI_IER_CRCERR_Msk & (_UINT32_(value) << MCSPI_IER_CRCERR_Pos)) /* Assigment of value for CRCERR in the MCSPI_IER register */
#define MCSPI_IER_TXFEF_Pos                   _UINT32_(24)                                         /* (MCSPI_IER) TXFEF Interrupt Enable Position */
#define MCSPI_IER_TXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IER_TXFEF_Pos)               /* (MCSPI_IER) TXFEF Interrupt Enable Mask */
#define MCSPI_IER_TXFEF(value)                (MCSPI_IER_TXFEF_Msk & (_UINT32_(value) << MCSPI_IER_TXFEF_Pos)) /* Assigment of value for TXFEF in the MCSPI_IER register */
#define MCSPI_IER_TXFFF_Pos                   _UINT32_(25)                                         /* (MCSPI_IER) TXFFF Interrupt Enable Position */
#define MCSPI_IER_TXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IER_TXFFF_Pos)               /* (MCSPI_IER) TXFFF Interrupt Enable Mask */
#define MCSPI_IER_TXFFF(value)                (MCSPI_IER_TXFFF_Msk & (_UINT32_(value) << MCSPI_IER_TXFFF_Pos)) /* Assigment of value for TXFFF in the MCSPI_IER register */
#define MCSPI_IER_TXFTHF_Pos                  _UINT32_(26)                                         /* (MCSPI_IER) TXFTHF Interrupt Enable Position */
#define MCSPI_IER_TXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IER_TXFTHF_Pos)              /* (MCSPI_IER) TXFTHF Interrupt Enable Mask */
#define MCSPI_IER_TXFTHF(value)               (MCSPI_IER_TXFTHF_Msk & (_UINT32_(value) << MCSPI_IER_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the MCSPI_IER register */
#define MCSPI_IER_RXFEF_Pos                   _UINT32_(27)                                         /* (MCSPI_IER) RXFEF Interrupt Enable Position */
#define MCSPI_IER_RXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IER_RXFEF_Pos)               /* (MCSPI_IER) RXFEF Interrupt Enable Mask */
#define MCSPI_IER_RXFEF(value)                (MCSPI_IER_RXFEF_Msk & (_UINT32_(value) << MCSPI_IER_RXFEF_Pos)) /* Assigment of value for RXFEF in the MCSPI_IER register */
#define MCSPI_IER_RXFFF_Pos                   _UINT32_(28)                                         /* (MCSPI_IER) RXFFF Interrupt Enable Position */
#define MCSPI_IER_RXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IER_RXFFF_Pos)               /* (MCSPI_IER) RXFFF Interrupt Enable Mask */
#define MCSPI_IER_RXFFF(value)                (MCSPI_IER_RXFFF_Msk & (_UINT32_(value) << MCSPI_IER_RXFFF_Pos)) /* Assigment of value for RXFFF in the MCSPI_IER register */
#define MCSPI_IER_RXFTHF_Pos                  _UINT32_(29)                                         /* (MCSPI_IER) RXFTHF Interrupt Enable Position */
#define MCSPI_IER_RXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IER_RXFTHF_Pos)              /* (MCSPI_IER) RXFTHF Interrupt Enable Mask */
#define MCSPI_IER_RXFTHF(value)               (MCSPI_IER_RXFTHF_Msk & (_UINT32_(value) << MCSPI_IER_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the MCSPI_IER register */
#define MCSPI_IER_TXFPTEF_Pos                 _UINT32_(30)                                         /* (MCSPI_IER) TXFPTEF Interrupt Enable Position */
#define MCSPI_IER_TXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IER_TXFPTEF_Pos)             /* (MCSPI_IER) TXFPTEF Interrupt Enable Mask */
#define MCSPI_IER_TXFPTEF(value)              (MCSPI_IER_TXFPTEF_Msk & (_UINT32_(value) << MCSPI_IER_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the MCSPI_IER register */
#define MCSPI_IER_RXFPTEF_Pos                 _UINT32_(31)                                         /* (MCSPI_IER) RXFPTEF Interrupt Enable Position */
#define MCSPI_IER_RXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IER_RXFPTEF_Pos)             /* (MCSPI_IER) RXFPTEF Interrupt Enable Mask */
#define MCSPI_IER_RXFPTEF(value)              (MCSPI_IER_RXFPTEF_Msk & (_UINT32_(value) << MCSPI_IER_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the MCSPI_IER register */
#define MCSPI_IER_Msk                         _UINT32_(0xFF002FFF)                                 /* (MCSPI_IER) Register Mask  */


/* -------- MCSPI_IDR : (MCSPI Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define MCSPI_IDR_RDRF_Pos                    _UINT32_(0)                                          /* (MCSPI_IDR) Receive Data Register Full Interrupt Disable Position */
#define MCSPI_IDR_RDRF_Msk                    (_UINT32_(0x1) << MCSPI_IDR_RDRF_Pos)                /* (MCSPI_IDR) Receive Data Register Full Interrupt Disable Mask */
#define MCSPI_IDR_RDRF(value)                 (MCSPI_IDR_RDRF_Msk & (_UINT32_(value) << MCSPI_IDR_RDRF_Pos)) /* Assigment of value for RDRF in the MCSPI_IDR register */
#define MCSPI_IDR_TDRE_Pos                    _UINT32_(1)                                          /* (MCSPI_IDR) MCSPI Transmit Data Register Empty Interrupt Disable Position */
#define MCSPI_IDR_TDRE_Msk                    (_UINT32_(0x1) << MCSPI_IDR_TDRE_Pos)                /* (MCSPI_IDR) MCSPI Transmit Data Register Empty Interrupt Disable Mask */
#define MCSPI_IDR_TDRE(value)                 (MCSPI_IDR_TDRE_Msk & (_UINT32_(value) << MCSPI_IDR_TDRE_Pos)) /* Assigment of value for TDRE in the MCSPI_IDR register */
#define MCSPI_IDR_MODF_Pos                    _UINT32_(2)                                          /* (MCSPI_IDR) Mode Fault Error Interrupt Disable Position */
#define MCSPI_IDR_MODF_Msk                    (_UINT32_(0x1) << MCSPI_IDR_MODF_Pos)                /* (MCSPI_IDR) Mode Fault Error Interrupt Disable Mask */
#define MCSPI_IDR_MODF(value)                 (MCSPI_IDR_MODF_Msk & (_UINT32_(value) << MCSPI_IDR_MODF_Pos)) /* Assigment of value for MODF in the MCSPI_IDR register */
#define MCSPI_IDR_OVRES_Pos                   _UINT32_(3)                                          /* (MCSPI_IDR) Overrun Error Interrupt Disable Position */
#define MCSPI_IDR_OVRES_Msk                   (_UINT32_(0x1) << MCSPI_IDR_OVRES_Pos)               /* (MCSPI_IDR) Overrun Error Interrupt Disable Mask */
#define MCSPI_IDR_OVRES(value)                (MCSPI_IDR_OVRES_Msk & (_UINT32_(value) << MCSPI_IDR_OVRES_Pos)) /* Assigment of value for OVRES in the MCSPI_IDR register */
#define MCSPI_IDR_ENDRX_Pos                   _UINT32_(4)                                          /* (MCSPI_IDR) End of Receive Buffer Interrupt Disable Position */
#define MCSPI_IDR_ENDRX_Msk                   (_UINT32_(0x1) << MCSPI_IDR_ENDRX_Pos)               /* (MCSPI_IDR) End of Receive Buffer Interrupt Disable Mask */
#define MCSPI_IDR_ENDRX(value)                (MCSPI_IDR_ENDRX_Msk & (_UINT32_(value) << MCSPI_IDR_ENDRX_Pos)) /* Assigment of value for ENDRX in the MCSPI_IDR register */
#define MCSPI_IDR_ENDTX_Pos                   _UINT32_(5)                                          /* (MCSPI_IDR) End of Transmit Buffer Interrupt Disable Position */
#define MCSPI_IDR_ENDTX_Msk                   (_UINT32_(0x1) << MCSPI_IDR_ENDTX_Pos)               /* (MCSPI_IDR) End of Transmit Buffer Interrupt Disable Mask */
#define MCSPI_IDR_ENDTX(value)                (MCSPI_IDR_ENDTX_Msk & (_UINT32_(value) << MCSPI_IDR_ENDTX_Pos)) /* Assigment of value for ENDTX in the MCSPI_IDR register */
#define MCSPI_IDR_RXBUFF_Pos                  _UINT32_(6)                                          /* (MCSPI_IDR) Receive Buffer Full Interrupt Disable Position */
#define MCSPI_IDR_RXBUFF_Msk                  (_UINT32_(0x1) << MCSPI_IDR_RXBUFF_Pos)              /* (MCSPI_IDR) Receive Buffer Full Interrupt Disable Mask */
#define MCSPI_IDR_RXBUFF(value)               (MCSPI_IDR_RXBUFF_Msk & (_UINT32_(value) << MCSPI_IDR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MCSPI_IDR register */
#define MCSPI_IDR_TXBUFE_Pos                  _UINT32_(7)                                          /* (MCSPI_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define MCSPI_IDR_TXBUFE_Msk                  (_UINT32_(0x1) << MCSPI_IDR_TXBUFE_Pos)              /* (MCSPI_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define MCSPI_IDR_TXBUFE(value)               (MCSPI_IDR_TXBUFE_Msk & (_UINT32_(value) << MCSPI_IDR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the MCSPI_IDR register */
#define MCSPI_IDR_NSSR_Pos                    _UINT32_(8)                                          /* (MCSPI_IDR) NSS Rising Interrupt Disable Position */
#define MCSPI_IDR_NSSR_Msk                    (_UINT32_(0x1) << MCSPI_IDR_NSSR_Pos)                /* (MCSPI_IDR) NSS Rising Interrupt Disable Mask */
#define MCSPI_IDR_NSSR(value)                 (MCSPI_IDR_NSSR_Msk & (_UINT32_(value) << MCSPI_IDR_NSSR_Pos)) /* Assigment of value for NSSR in the MCSPI_IDR register */
#define MCSPI_IDR_TXEMPTY_Pos                 _UINT32_(9)                                          /* (MCSPI_IDR) Transmission Registers Empty Disable Position */
#define MCSPI_IDR_TXEMPTY_Msk                 (_UINT32_(0x1) << MCSPI_IDR_TXEMPTY_Pos)             /* (MCSPI_IDR) Transmission Registers Empty Disable Mask */
#define MCSPI_IDR_TXEMPTY(value)              (MCSPI_IDR_TXEMPTY_Msk & (_UINT32_(value) << MCSPI_IDR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the MCSPI_IDR register */
#define MCSPI_IDR_UNDES_Pos                   _UINT32_(10)                                         /* (MCSPI_IDR) Underrun Error Interrupt Disable Position */
#define MCSPI_IDR_UNDES_Msk                   (_UINT32_(0x1) << MCSPI_IDR_UNDES_Pos)               /* (MCSPI_IDR) Underrun Error Interrupt Disable Mask */
#define MCSPI_IDR_UNDES(value)                (MCSPI_IDR_UNDES_Msk & (_UINT32_(value) << MCSPI_IDR_UNDES_Pos)) /* Assigment of value for UNDES in the MCSPI_IDR register */
#define MCSPI_IDR_CMP_Pos                     _UINT32_(11)                                         /* (MCSPI_IDR) Comparison Interrupt Disable Position */
#define MCSPI_IDR_CMP_Msk                     (_UINT32_(0x1) << MCSPI_IDR_CMP_Pos)                 /* (MCSPI_IDR) Comparison Interrupt Disable Mask */
#define MCSPI_IDR_CMP(value)                  (MCSPI_IDR_CMP_Msk & (_UINT32_(value) << MCSPI_IDR_CMP_Pos)) /* Assigment of value for CMP in the MCSPI_IDR register */
#define MCSPI_IDR_CRCERR_Pos                  _UINT32_(13)                                         /* (MCSPI_IDR) CRC Error Interrupt Disable Position */
#define MCSPI_IDR_CRCERR_Msk                  (_UINT32_(0x1) << MCSPI_IDR_CRCERR_Pos)              /* (MCSPI_IDR) CRC Error Interrupt Disable Mask */
#define MCSPI_IDR_CRCERR(value)               (MCSPI_IDR_CRCERR_Msk & (_UINT32_(value) << MCSPI_IDR_CRCERR_Pos)) /* Assigment of value for CRCERR in the MCSPI_IDR register */
#define MCSPI_IDR_TXFEF_Pos                   _UINT32_(24)                                         /* (MCSPI_IDR) TXFEF Interrupt Disable Position */
#define MCSPI_IDR_TXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IDR_TXFEF_Pos)               /* (MCSPI_IDR) TXFEF Interrupt Disable Mask */
#define MCSPI_IDR_TXFEF(value)                (MCSPI_IDR_TXFEF_Msk & (_UINT32_(value) << MCSPI_IDR_TXFEF_Pos)) /* Assigment of value for TXFEF in the MCSPI_IDR register */
#define MCSPI_IDR_TXFFF_Pos                   _UINT32_(25)                                         /* (MCSPI_IDR) TXFFF Interrupt Disable Position */
#define MCSPI_IDR_TXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IDR_TXFFF_Pos)               /* (MCSPI_IDR) TXFFF Interrupt Disable Mask */
#define MCSPI_IDR_TXFFF(value)                (MCSPI_IDR_TXFFF_Msk & (_UINT32_(value) << MCSPI_IDR_TXFFF_Pos)) /* Assigment of value for TXFFF in the MCSPI_IDR register */
#define MCSPI_IDR_TXFTHF_Pos                  _UINT32_(26)                                         /* (MCSPI_IDR) TXFTHF Interrupt Disable Position */
#define MCSPI_IDR_TXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IDR_TXFTHF_Pos)              /* (MCSPI_IDR) TXFTHF Interrupt Disable Mask */
#define MCSPI_IDR_TXFTHF(value)               (MCSPI_IDR_TXFTHF_Msk & (_UINT32_(value) << MCSPI_IDR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the MCSPI_IDR register */
#define MCSPI_IDR_RXFEF_Pos                   _UINT32_(27)                                         /* (MCSPI_IDR) RXFEF Interrupt Disable Position */
#define MCSPI_IDR_RXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IDR_RXFEF_Pos)               /* (MCSPI_IDR) RXFEF Interrupt Disable Mask */
#define MCSPI_IDR_RXFEF(value)                (MCSPI_IDR_RXFEF_Msk & (_UINT32_(value) << MCSPI_IDR_RXFEF_Pos)) /* Assigment of value for RXFEF in the MCSPI_IDR register */
#define MCSPI_IDR_RXFFF_Pos                   _UINT32_(28)                                         /* (MCSPI_IDR) RXFFF Interrupt Disable Position */
#define MCSPI_IDR_RXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IDR_RXFFF_Pos)               /* (MCSPI_IDR) RXFFF Interrupt Disable Mask */
#define MCSPI_IDR_RXFFF(value)                (MCSPI_IDR_RXFFF_Msk & (_UINT32_(value) << MCSPI_IDR_RXFFF_Pos)) /* Assigment of value for RXFFF in the MCSPI_IDR register */
#define MCSPI_IDR_RXFTHF_Pos                  _UINT32_(29)                                         /* (MCSPI_IDR) RXFTHF Interrupt Disable Position */
#define MCSPI_IDR_RXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IDR_RXFTHF_Pos)              /* (MCSPI_IDR) RXFTHF Interrupt Disable Mask */
#define MCSPI_IDR_RXFTHF(value)               (MCSPI_IDR_RXFTHF_Msk & (_UINT32_(value) << MCSPI_IDR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the MCSPI_IDR register */
#define MCSPI_IDR_TXFPTEF_Pos                 _UINT32_(30)                                         /* (MCSPI_IDR) TXFPTEF Interrupt Disable Position */
#define MCSPI_IDR_TXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IDR_TXFPTEF_Pos)             /* (MCSPI_IDR) TXFPTEF Interrupt Disable Mask */
#define MCSPI_IDR_TXFPTEF(value)              (MCSPI_IDR_TXFPTEF_Msk & (_UINT32_(value) << MCSPI_IDR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the MCSPI_IDR register */
#define MCSPI_IDR_RXFPTEF_Pos                 _UINT32_(31)                                         /* (MCSPI_IDR) RXFPTEF Interrupt Disable Position */
#define MCSPI_IDR_RXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IDR_RXFPTEF_Pos)             /* (MCSPI_IDR) RXFPTEF Interrupt Disable Mask */
#define MCSPI_IDR_RXFPTEF(value)              (MCSPI_IDR_RXFPTEF_Msk & (_UINT32_(value) << MCSPI_IDR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the MCSPI_IDR register */
#define MCSPI_IDR_Msk                         _UINT32_(0xFF002FFF)                                 /* (MCSPI_IDR) Register Mask  */


