Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
/* -------- MCSPI_IMR : (MCSPI Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define MCSPI_IMR_RDRF_Pos                    _UINT32_(0)                                          /* (MCSPI_IMR) Receive Data Register Full Interrupt Mask Position */
#define MCSPI_IMR_RDRF_Msk                    (_UINT32_(0x1) << MCSPI_IMR_RDRF_Pos)                /* (MCSPI_IMR) Receive Data Register Full Interrupt Mask Mask */
#define MCSPI_IMR_RDRF(value)                 (MCSPI_IMR_RDRF_Msk & (_UINT32_(value) << MCSPI_IMR_RDRF_Pos)) /* Assigment of value for RDRF in the MCSPI_IMR register */
#define MCSPI_IMR_TDRE_Pos                    _UINT32_(1)                                          /* (MCSPI_IMR) MCSPI Transmit Data Register Empty Interrupt Mask Position */
#define MCSPI_IMR_TDRE_Msk                    (_UINT32_(0x1) << MCSPI_IMR_TDRE_Pos)                /* (MCSPI_IMR) MCSPI Transmit Data Register Empty Interrupt Mask Mask */
#define MCSPI_IMR_TDRE(value)                 (MCSPI_IMR_TDRE_Msk & (_UINT32_(value) << MCSPI_IMR_TDRE_Pos)) /* Assigment of value for TDRE in the MCSPI_IMR register */
#define MCSPI_IMR_MODF_Pos                    _UINT32_(2)                                          /* (MCSPI_IMR) Mode Fault Error Interrupt Mask Position */
#define MCSPI_IMR_MODF_Msk                    (_UINT32_(0x1) << MCSPI_IMR_MODF_Pos)                /* (MCSPI_IMR) Mode Fault Error Interrupt Mask Mask */
#define MCSPI_IMR_MODF(value)                 (MCSPI_IMR_MODF_Msk & (_UINT32_(value) << MCSPI_IMR_MODF_Pos)) /* Assigment of value for MODF in the MCSPI_IMR register */
#define MCSPI_IMR_OVRES_Pos                   _UINT32_(3)                                          /* (MCSPI_IMR) Overrun Error Interrupt Mask Position */
#define MCSPI_IMR_OVRES_Msk                   (_UINT32_(0x1) << MCSPI_IMR_OVRES_Pos)               /* (MCSPI_IMR) Overrun Error Interrupt Mask Mask */
#define MCSPI_IMR_OVRES(value)                (MCSPI_IMR_OVRES_Msk & (_UINT32_(value) << MCSPI_IMR_OVRES_Pos)) /* Assigment of value for OVRES in the MCSPI_IMR register */
#define MCSPI_IMR_ENDRX_Pos                   _UINT32_(4)                                          /* (MCSPI_IMR) End of Receive Buffer Interrupt Mask Position */
#define MCSPI_IMR_ENDRX_Msk                   (_UINT32_(0x1) << MCSPI_IMR_ENDRX_Pos)               /* (MCSPI_IMR) End of Receive Buffer Interrupt Mask Mask */
#define MCSPI_IMR_ENDRX(value)                (MCSPI_IMR_ENDRX_Msk & (_UINT32_(value) << MCSPI_IMR_ENDRX_Pos)) /* Assigment of value for ENDRX in the MCSPI_IMR register */
#define MCSPI_IMR_ENDTX_Pos                   _UINT32_(5)                                          /* (MCSPI_IMR) End of Transmit Buffer Interrupt Mask Position */
#define MCSPI_IMR_ENDTX_Msk                   (_UINT32_(0x1) << MCSPI_IMR_ENDTX_Pos)               /* (MCSPI_IMR) End of Transmit Buffer Interrupt Mask Mask */
#define MCSPI_IMR_ENDTX(value)                (MCSPI_IMR_ENDTX_Msk & (_UINT32_(value) << MCSPI_IMR_ENDTX_Pos)) /* Assigment of value for ENDTX in the MCSPI_IMR register */
#define MCSPI_IMR_RXBUFF_Pos                  _UINT32_(6)                                          /* (MCSPI_IMR) Receive Buffer Full Interrupt Mask Position */
#define MCSPI_IMR_RXBUFF_Msk                  (_UINT32_(0x1) << MCSPI_IMR_RXBUFF_Pos)              /* (MCSPI_IMR) Receive Buffer Full Interrupt Mask Mask */
#define MCSPI_IMR_RXBUFF(value)               (MCSPI_IMR_RXBUFF_Msk & (_UINT32_(value) << MCSPI_IMR_RXBUFF_Pos)) /* Assigment of value for RXBUFF in the MCSPI_IMR register */
#define MCSPI_IMR_TXBUFE_Pos                  _UINT32_(7)                                          /* (MCSPI_IMR) Transmit Buffer Empty Interrupt Mask Position */
#define MCSPI_IMR_TXBUFE_Msk                  (_UINT32_(0x1) << MCSPI_IMR_TXBUFE_Pos)              /* (MCSPI_IMR) Transmit Buffer Empty Interrupt Mask Mask */
#define MCSPI_IMR_TXBUFE(value)               (MCSPI_IMR_TXBUFE_Msk & (_UINT32_(value) << MCSPI_IMR_TXBUFE_Pos)) /* Assigment of value for TXBUFE in the MCSPI_IMR register */
#define MCSPI_IMR_NSSR_Pos                    _UINT32_(8)                                          /* (MCSPI_IMR) NSS Rising Interrupt Mask Position */
#define MCSPI_IMR_NSSR_Msk                    (_UINT32_(0x1) << MCSPI_IMR_NSSR_Pos)                /* (MCSPI_IMR) NSS Rising Interrupt Mask Mask */
#define MCSPI_IMR_NSSR(value)                 (MCSPI_IMR_NSSR_Msk & (_UINT32_(value) << MCSPI_IMR_NSSR_Pos)) /* Assigment of value for NSSR in the MCSPI_IMR register */
#define MCSPI_IMR_TXEMPTY_Pos                 _UINT32_(9)                                          /* (MCSPI_IMR) Transmission Registers Empty Mask Position */
#define MCSPI_IMR_TXEMPTY_Msk                 (_UINT32_(0x1) << MCSPI_IMR_TXEMPTY_Pos)             /* (MCSPI_IMR) Transmission Registers Empty Mask Mask */
#define MCSPI_IMR_TXEMPTY(value)              (MCSPI_IMR_TXEMPTY_Msk & (_UINT32_(value) << MCSPI_IMR_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the MCSPI_IMR register */
#define MCSPI_IMR_UNDES_Pos                   _UINT32_(10)                                         /* (MCSPI_IMR) Underrun Error Interrupt Mask Position */
#define MCSPI_IMR_UNDES_Msk                   (_UINT32_(0x1) << MCSPI_IMR_UNDES_Pos)               /* (MCSPI_IMR) Underrun Error Interrupt Mask Mask */
#define MCSPI_IMR_UNDES(value)                (MCSPI_IMR_UNDES_Msk & (_UINT32_(value) << MCSPI_IMR_UNDES_Pos)) /* Assigment of value for UNDES in the MCSPI_IMR register */
#define MCSPI_IMR_CMP_Pos                     _UINT32_(11)                                         /* (MCSPI_IMR) Comparison Interrupt Mask Position */
#define MCSPI_IMR_CMP_Msk                     (_UINT32_(0x1) << MCSPI_IMR_CMP_Pos)                 /* (MCSPI_IMR) Comparison Interrupt Mask Mask */
#define MCSPI_IMR_CMP(value)                  (MCSPI_IMR_CMP_Msk & (_UINT32_(value) << MCSPI_IMR_CMP_Pos)) /* Assigment of value for CMP in the MCSPI_IMR register */
#define MCSPI_IMR_CRCERR_Pos                  _UINT32_(13)                                         /* (MCSPI_IMR) CRC Error Interrupt Mask Position */
#define MCSPI_IMR_CRCERR_Msk                  (_UINT32_(0x1) << MCSPI_IMR_CRCERR_Pos)              /* (MCSPI_IMR) CRC Error Interrupt Mask Mask */
#define MCSPI_IMR_CRCERR(value)               (MCSPI_IMR_CRCERR_Msk & (_UINT32_(value) << MCSPI_IMR_CRCERR_Pos)) /* Assigment of value for CRCERR in the MCSPI_IMR register */
#define MCSPI_IMR_TXFEF_Pos                   _UINT32_(24)                                         /* (MCSPI_IMR) TXFEF Interrupt Mask Position */
#define MCSPI_IMR_TXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IMR_TXFEF_Pos)               /* (MCSPI_IMR) TXFEF Interrupt Mask Mask */
#define MCSPI_IMR_TXFEF(value)                (MCSPI_IMR_TXFEF_Msk & (_UINT32_(value) << MCSPI_IMR_TXFEF_Pos)) /* Assigment of value for TXFEF in the MCSPI_IMR register */
#define MCSPI_IMR_TXFFF_Pos                   _UINT32_(25)                                         /* (MCSPI_IMR) TXFFF Interrupt Mask Position */
#define MCSPI_IMR_TXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IMR_TXFFF_Pos)               /* (MCSPI_IMR) TXFFF Interrupt Mask Mask */
#define MCSPI_IMR_TXFFF(value)                (MCSPI_IMR_TXFFF_Msk & (_UINT32_(value) << MCSPI_IMR_TXFFF_Pos)) /* Assigment of value for TXFFF in the MCSPI_IMR register */
#define MCSPI_IMR_TXFTHF_Pos                  _UINT32_(26)                                         /* (MCSPI_IMR) TXFTHF Interrupt Mask Position */
#define MCSPI_IMR_TXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IMR_TXFTHF_Pos)              /* (MCSPI_IMR) TXFTHF Interrupt Mask Mask */
#define MCSPI_IMR_TXFTHF(value)               (MCSPI_IMR_TXFTHF_Msk & (_UINT32_(value) << MCSPI_IMR_TXFTHF_Pos)) /* Assigment of value for TXFTHF in the MCSPI_IMR register */
#define MCSPI_IMR_RXFEF_Pos                   _UINT32_(27)                                         /* (MCSPI_IMR) RXFEF Interrupt Mask Position */
#define MCSPI_IMR_RXFEF_Msk                   (_UINT32_(0x1) << MCSPI_IMR_RXFEF_Pos)               /* (MCSPI_IMR) RXFEF Interrupt Mask Mask */
#define MCSPI_IMR_RXFEF(value)                (MCSPI_IMR_RXFEF_Msk & (_UINT32_(value) << MCSPI_IMR_RXFEF_Pos)) /* Assigment of value for RXFEF in the MCSPI_IMR register */
#define MCSPI_IMR_RXFFF_Pos                   _UINT32_(28)                                         /* (MCSPI_IMR) RXFFF Interrupt Mask Position */
#define MCSPI_IMR_RXFFF_Msk                   (_UINT32_(0x1) << MCSPI_IMR_RXFFF_Pos)               /* (MCSPI_IMR) RXFFF Interrupt Mask Mask */
#define MCSPI_IMR_RXFFF(value)                (MCSPI_IMR_RXFFF_Msk & (_UINT32_(value) << MCSPI_IMR_RXFFF_Pos)) /* Assigment of value for RXFFF in the MCSPI_IMR register */
#define MCSPI_IMR_RXFTHF_Pos                  _UINT32_(29)                                         /* (MCSPI_IMR) RXFTHF Interrupt Mask Position */
#define MCSPI_IMR_RXFTHF_Msk                  (_UINT32_(0x1) << MCSPI_IMR_RXFTHF_Pos)              /* (MCSPI_IMR) RXFTHF Interrupt Mask Mask */
#define MCSPI_IMR_RXFTHF(value)               (MCSPI_IMR_RXFTHF_Msk & (_UINT32_(value) << MCSPI_IMR_RXFTHF_Pos)) /* Assigment of value for RXFTHF in the MCSPI_IMR register */
#define MCSPI_IMR_TXFPTEF_Pos                 _UINT32_(30)                                         /* (MCSPI_IMR) TXFPTEF Interrupt Mask Position */
#define MCSPI_IMR_TXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IMR_TXFPTEF_Pos)             /* (MCSPI_IMR) TXFPTEF Interrupt Mask Mask */
#define MCSPI_IMR_TXFPTEF(value)              (MCSPI_IMR_TXFPTEF_Msk & (_UINT32_(value) << MCSPI_IMR_TXFPTEF_Pos)) /* Assigment of value for TXFPTEF in the MCSPI_IMR register */
#define MCSPI_IMR_RXFPTEF_Pos                 _UINT32_(31)                                         /* (MCSPI_IMR) RXFPTEF Interrupt Mask Position */
#define MCSPI_IMR_RXFPTEF_Msk                 (_UINT32_(0x1) << MCSPI_IMR_RXFPTEF_Pos)             /* (MCSPI_IMR) RXFPTEF Interrupt Mask Mask */
#define MCSPI_IMR_RXFPTEF(value)              (MCSPI_IMR_RXFPTEF_Msk & (_UINT32_(value) << MCSPI_IMR_RXFPTEF_Pos)) /* Assigment of value for RXFPTEF in the MCSPI_IMR register */
#define MCSPI_IMR_Msk                         _UINT32_(0xFF002FFF)                                 /* (MCSPI_IMR) Register Mask  */


/* -------- MCSPI_CSR : (MCSPI Offset: 0x30) (R/W 32) Chip Select Register (CS_number = 0) -------- */
#define MCSPI_CSR_CPOL_Pos                    _UINT32_(0)                                          /* (MCSPI_CSR) Clock Polarity Position */
#define MCSPI_CSR_CPOL_Msk                    (_UINT32_(0x1) << MCSPI_CSR_CPOL_Pos)                /* (MCSPI_CSR) Clock Polarity Mask */
#define MCSPI_CSR_CPOL(value)                 (MCSPI_CSR_CPOL_Msk & (_UINT32_(value) << MCSPI_CSR_CPOL_Pos)) /* Assigment of value for CPOL in the MCSPI_CSR register */
#define MCSPI_CSR_NCPHA_Pos                   _UINT32_(1)                                          /* (MCSPI_CSR) Clock Phase Position */
#define MCSPI_CSR_NCPHA_Msk                   (_UINT32_(0x1) << MCSPI_CSR_NCPHA_Pos)               /* (MCSPI_CSR) Clock Phase Mask */
#define MCSPI_CSR_NCPHA(value)                (MCSPI_CSR_NCPHA_Msk & (_UINT32_(value) << MCSPI_CSR_NCPHA_Pos)) /* Assigment of value for NCPHA in the MCSPI_CSR register */
#define MCSPI_CSR_CSNAAT_Pos                  _UINT32_(2)                                          /* (MCSPI_CSR) Chip Select Not Active After Transfer (ignored if CSAAT = 1) Position */
#define MCSPI_CSR_CSNAAT_Msk                  (_UINT32_(0x1) << MCSPI_CSR_CSNAAT_Pos)              /* (MCSPI_CSR) Chip Select Not Active After Transfer (ignored if CSAAT = 1) Mask */
#define MCSPI_CSR_CSNAAT(value)               (MCSPI_CSR_CSNAAT_Msk & (_UINT32_(value) << MCSPI_CSR_CSNAAT_Pos)) /* Assigment of value for CSNAAT in the MCSPI_CSR register */
#define MCSPI_CSR_CSAAT_Pos                   _UINT32_(3)                                          /* (MCSPI_CSR) Chip Select Active After Transfer Position */
#define MCSPI_CSR_CSAAT_Msk                   (_UINT32_(0x1) << MCSPI_CSR_CSAAT_Pos)               /* (MCSPI_CSR) Chip Select Active After Transfer Mask */
#define MCSPI_CSR_CSAAT(value)                (MCSPI_CSR_CSAAT_Msk & (_UINT32_(value) << MCSPI_CSR_CSAAT_Pos)) /* Assigment of value for CSAAT in the MCSPI_CSR register */
#define MCSPI_CSR_BITS_Pos                    _UINT32_(4)                                          /* (MCSPI_CSR) Bits Per Transfer Position */
#define MCSPI_CSR_BITS_Msk                    (_UINT32_(0xF) << MCSPI_CSR_BITS_Pos)                /* (MCSPI_CSR) Bits Per Transfer Mask */
#define MCSPI_CSR_BITS(value)                 (MCSPI_CSR_BITS_Msk & (_UINT32_(value) << MCSPI_CSR_BITS_Pos)) /* Assigment of value for BITS in the MCSPI_CSR register */
#define   MCSPI_CSR_BITS_8_BIT_Val            _UINT32_(0x0)                                        /* (MCSPI_CSR) 8 bits for transfer  */
#define   MCSPI_CSR_BITS_9_BIT_Val            _UINT32_(0x1)                                        /* (MCSPI_CSR) 9 bits for transfer  */
#define   MCSPI_CSR_BITS_10_BIT_Val           _UINT32_(0x2)                                        /* (MCSPI_CSR) 10 bits for transfer  */
#define   MCSPI_CSR_BITS_11_BIT_Val           _UINT32_(0x3)                                        /* (MCSPI_CSR) 11 bits for transfer  */
#define   MCSPI_CSR_BITS_12_BIT_Val           _UINT32_(0x4)                                        /* (MCSPI_CSR) 12 bits for transfer  */
#define   MCSPI_CSR_BITS_13_BIT_Val           _UINT32_(0x5)                                        /* (MCSPI_CSR) 13 bits for transfer  */
#define   MCSPI_CSR_BITS_14_BIT_Val           _UINT32_(0x6)                                        /* (MCSPI_CSR) 14 bits for transfer  */
#define   MCSPI_CSR_BITS_15_BIT_Val           _UINT32_(0x7)                                        /* (MCSPI_CSR) 15 bits for transfer  */
#define   MCSPI_CSR_BITS_16_BIT_Val           _UINT32_(0x8)                                        /* (MCSPI_CSR) 16 bits for transfer  */
#define MCSPI_CSR_BITS_8_BIT                  (MCSPI_CSR_BITS_8_BIT_Val << MCSPI_CSR_BITS_Pos)     /* (MCSPI_CSR) 8 bits for transfer Position  */
#define MCSPI_CSR_BITS_9_BIT                  (MCSPI_CSR_BITS_9_BIT_Val << MCSPI_CSR_BITS_Pos)     /* (MCSPI_CSR) 9 bits for transfer Position  */
#define MCSPI_CSR_BITS_10_BIT                 (MCSPI_CSR_BITS_10_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 10 bits for transfer Position  */
#define MCSPI_CSR_BITS_11_BIT                 (MCSPI_CSR_BITS_11_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 11 bits for transfer Position  */
#define MCSPI_CSR_BITS_12_BIT                 (MCSPI_CSR_BITS_12_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 12 bits for transfer Position  */
#define MCSPI_CSR_BITS_13_BIT                 (MCSPI_CSR_BITS_13_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 13 bits for transfer Position  */
#define MCSPI_CSR_BITS_14_BIT                 (MCSPI_CSR_BITS_14_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 14 bits for transfer Position  */
#define MCSPI_CSR_BITS_15_BIT                 (MCSPI_CSR_BITS_15_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 15 bits for transfer Position  */
#define MCSPI_CSR_BITS_16_BIT                 (MCSPI_CSR_BITS_16_BIT_Val << MCSPI_CSR_BITS_Pos)    /* (MCSPI_CSR) 16 bits for transfer Position  */
#define MCSPI_CSR_SCBR_Pos                    _UINT32_(8)                                          /* (MCSPI_CSR) Serial Clock Bit Rate Position */
#define MCSPI_CSR_SCBR_Msk                    (_UINT32_(0xFF) << MCSPI_CSR_SCBR_Pos)               /* (MCSPI_CSR) Serial Clock Bit Rate Mask */
#define MCSPI_CSR_SCBR(value)                 (MCSPI_CSR_SCBR_Msk & (_UINT32_(value) << MCSPI_CSR_SCBR_Pos)) /* Assigment of value for SCBR in the MCSPI_CSR register */
#define MCSPI_CSR_DLYBS_Pos                   _UINT32_(16)                                         /* (MCSPI_CSR) Delay Before SPCK Position */
#define MCSPI_CSR_DLYBS_Msk                   (_UINT32_(0xFF) << MCSPI_CSR_DLYBS_Pos)              /* (MCSPI_CSR) Delay Before SPCK Mask */
#define MCSPI_CSR_DLYBS(value)                (MCSPI_CSR_DLYBS_Msk & (_UINT32_(value) << MCSPI_CSR_DLYBS_Pos)) /* Assigment of value for DLYBS in the MCSPI_CSR register */
#define MCSPI_CSR_DLYBCT_Pos                  _UINT32_(24)                                         /* (MCSPI_CSR) Delay Between Consecutive Transfers Position */
#define MCSPI_CSR_DLYBCT_Msk                  (_UINT32_(0xFF) << MCSPI_CSR_DLYBCT_Pos)             /* (MCSPI_CSR) Delay Between Consecutive Transfers Mask */
#define MCSPI_CSR_DLYBCT(value)               (MCSPI_CSR_DLYBCT_Msk & (_UINT32_(value) << MCSPI_CSR_DLYBCT_Pos)) /* Assigment of value for DLYBCT in the MCSPI_CSR register */
#define MCSPI_CSR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_CSR) Register Mask  */


