Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
/* -------- MCSPI_FMR : (MCSPI Offset: 0x40) (R/W 32) FIFO Mode Register -------- */
#define MCSPI_FMR_TXRDYM_Pos                  _UINT32_(0)                                          /* (MCSPI_FMR) Transmit Data Register Empty Mode Position */
#define MCSPI_FMR_TXRDYM_Msk                  (_UINT32_(0x3) << MCSPI_FMR_TXRDYM_Pos)              /* (MCSPI_FMR) Transmit Data Register Empty Mode Mask */
#define MCSPI_FMR_TXRDYM(value)               (MCSPI_FMR_TXRDYM_Msk & (_UINT32_(value) << MCSPI_FMR_TXRDYM_Pos)) /* Assigment of value for TXRDYM in the MCSPI_FMR register */
#define   MCSPI_FMR_TXRDYM_ONE_DATA_Val       _UINT32_(0x0)                                        /* (MCSPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.  */
#define   MCSPI_FMR_TXRDYM_TWO_DATA_Val       _UINT32_(0x1)                                        /* (MCSPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if MCSPI_MR.PS =1.  */
#define MCSPI_FMR_TXRDYM_ONE_DATA             (MCSPI_FMR_TXRDYM_ONE_DATA_Val << MCSPI_FMR_TXRDYM_Pos) /* (MCSPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO. Position  */
#define MCSPI_FMR_TXRDYM_TWO_DATA             (MCSPI_FMR_TXRDYM_TWO_DATA_Val << MCSPI_FMR_TXRDYM_Pos) /* (MCSPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if MCSPI_MR.PS =1. Position  */
#define MCSPI_FMR_RXRDYM_Pos                  _UINT32_(4)                                          /* (MCSPI_FMR) Receive Data Register Full Mode Position */
#define MCSPI_FMR_RXRDYM_Msk                  (_UINT32_(0x3) << MCSPI_FMR_RXRDYM_Pos)              /* (MCSPI_FMR) Receive Data Register Full Mode Mask */
#define MCSPI_FMR_RXRDYM(value)               (MCSPI_FMR_RXRDYM_Msk & (_UINT32_(value) << MCSPI_FMR_RXRDYM_Pos)) /* Assigment of value for RXRDYM in the MCSPI_FMR register */
#define   MCSPI_FMR_RXRDYM_ONE_DATA_Val       _UINT32_(0x0)                                        /* (MCSPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO.  */
#define   MCSPI_FMR_RXRDYM_TWO_DATA_Val       _UINT32_(0x1)                                        /* (MCSPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used when MCSPI_MR.MSTR =1, or if MCSPI_MR.PS =1.  */
#define   MCSPI_FMR_RXRDYM_FOUR_DATA_Val      _UINT32_(0x2)                                        /* (MCSPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when MCSPI_CSRx.BITS is greater than 0, or if MCSPI_MR.MSTR = 1, or if MCSPI_MR.PS = 1.  */
#define MCSPI_FMR_RXRDYM_ONE_DATA             (MCSPI_FMR_RXRDYM_ONE_DATA_Val << MCSPI_FMR_RXRDYM_Pos) /* (MCSPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO. Position  */
#define MCSPI_FMR_RXRDYM_TWO_DATA             (MCSPI_FMR_RXRDYM_TWO_DATA_Val << MCSPI_FMR_RXRDYM_Pos) /* (MCSPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used when MCSPI_MR.MSTR =1, or if MCSPI_MR.PS =1. Position  */
#define MCSPI_FMR_RXRDYM_FOUR_DATA            (MCSPI_FMR_RXRDYM_FOUR_DATA_Val << MCSPI_FMR_RXRDYM_Pos) /* (MCSPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when MCSPI_CSRx.BITS is greater than 0, or if MCSPI_MR.MSTR = 1, or if MCSPI_MR.PS = 1. Position  */
#define MCSPI_FMR_TXFTHRES_Pos                _UINT32_(16)                                         /* (MCSPI_FMR) Transmit FIFO Threshold Position */
#define MCSPI_FMR_TXFTHRES_Msk                (_UINT32_(0x3F) << MCSPI_FMR_TXFTHRES_Pos)           /* (MCSPI_FMR) Transmit FIFO Threshold Mask */
#define MCSPI_FMR_TXFTHRES(value)             (MCSPI_FMR_TXFTHRES_Msk & (_UINT32_(value) << MCSPI_FMR_TXFTHRES_Pos)) /* Assigment of value for TXFTHRES in the MCSPI_FMR register */
#define MCSPI_FMR_RXFTHRES_Pos                _UINT32_(24)                                         /* (MCSPI_FMR) Receive FIFO Threshold Position */
#define MCSPI_FMR_RXFTHRES_Msk                (_UINT32_(0x3F) << MCSPI_FMR_RXFTHRES_Pos)           /* (MCSPI_FMR) Receive FIFO Threshold Mask */
#define MCSPI_FMR_RXFTHRES(value)             (MCSPI_FMR_RXFTHRES_Msk & (_UINT32_(value) << MCSPI_FMR_RXFTHRES_Pos)) /* Assigment of value for RXFTHRES in the MCSPI_FMR register */
#define MCSPI_FMR_Msk                         _UINT32_(0x3F3F0033)                                 /* (MCSPI_FMR) Register Mask  */


/* -------- MCSPI_FLR : (MCSPI Offset: 0x44) ( R/ 32) FIFO Level Register -------- */
#define MCSPI_FLR_TXFL_Pos                    _UINT32_(0)                                          /* (MCSPI_FLR) Transmit FIFO Level Position */
#define MCSPI_FLR_TXFL_Msk                    (_UINT32_(0x3F) << MCSPI_FLR_TXFL_Pos)               /* (MCSPI_FLR) Transmit FIFO Level Mask */
#define MCSPI_FLR_TXFL(value)                 (MCSPI_FLR_TXFL_Msk & (_UINT32_(value) << MCSPI_FLR_TXFL_Pos)) /* Assigment of value for TXFL in the MCSPI_FLR register */
#define MCSPI_FLR_RXFL_Pos                    _UINT32_(16)                                         /* (MCSPI_FLR) Receive FIFO Level Position */
#define MCSPI_FLR_RXFL_Msk                    (_UINT32_(0x3F) << MCSPI_FLR_RXFL_Pos)               /* (MCSPI_FLR) Receive FIFO Level Mask */
#define MCSPI_FLR_RXFL(value)                 (MCSPI_FLR_RXFL_Msk & (_UINT32_(value) << MCSPI_FLR_RXFL_Pos)) /* Assigment of value for RXFL in the MCSPI_FLR register */
#define MCSPI_FLR_Msk                         _UINT32_(0x003F003F)                                 /* (MCSPI_FLR) Register Mask  */


/* -------- MCSPI_CMPR : (MCSPI Offset: 0x48) (R/W 32) Comparison Register -------- */
#define MCSPI_CMPR_VAL1_Pos                   _UINT32_(0)                                          /* (MCSPI_CMPR) First Comparison Value for Received Character Position */
#define MCSPI_CMPR_VAL1_Msk                   (_UINT32_(0xFFFF) << MCSPI_CMPR_VAL1_Pos)            /* (MCSPI_CMPR) First Comparison Value for Received Character Mask */
#define MCSPI_CMPR_VAL1(value)                (MCSPI_CMPR_VAL1_Msk & (_UINT32_(value) << MCSPI_CMPR_VAL1_Pos)) /* Assigment of value for VAL1 in the MCSPI_CMPR register */
#define MCSPI_CMPR_VAL2_Pos                   _UINT32_(16)                                         /* (MCSPI_CMPR) Second Comparison Value for Received Character Position */
#define MCSPI_CMPR_VAL2_Msk                   (_UINT32_(0xFFFF) << MCSPI_CMPR_VAL2_Pos)            /* (MCSPI_CMPR) Second Comparison Value for Received Character Mask */
#define MCSPI_CMPR_VAL2(value)                (MCSPI_CMPR_VAL2_Msk & (_UINT32_(value) << MCSPI_CMPR_VAL2_Pos)) /* Assigment of value for VAL2 in the MCSPI_CMPR register */
#define MCSPI_CMPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_CMPR) Register Mask  */


