Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
/* -------- MCSPI_RNPR : (MCSPI Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define MCSPI_RNPR_RXNPTR_Pos                 _UINT32_(0)                                          /* (MCSPI_RNPR) Receive Next Pointer Position */
#define MCSPI_RNPR_RXNPTR_Msk                 (_UINT32_(0xFFFFFFFF) << MCSPI_RNPR_RXNPTR_Pos)      /* (MCSPI_RNPR) Receive Next Pointer Mask */
#define MCSPI_RNPR_RXNPTR(value)              (MCSPI_RNPR_RXNPTR_Msk & (_UINT32_(value) << MCSPI_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the MCSPI_RNPR register */
#define MCSPI_RNPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_RNPR) Register Mask  */


/* -------- MCSPI_RNCR : (MCSPI Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define MCSPI_RNCR_RXNCTR_Pos                 _UINT32_(0)                                          /* (MCSPI_RNCR) Receive Next Counter Position */
#define MCSPI_RNCR_RXNCTR_Msk                 (_UINT32_(0xFFFF) << MCSPI_RNCR_RXNCTR_Pos)          /* (MCSPI_RNCR) Receive Next Counter Mask */
#define MCSPI_RNCR_RXNCTR(value)              (MCSPI_RNCR_RXNCTR_Msk & (_UINT32_(value) << MCSPI_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the MCSPI_RNCR register */
#define MCSPI_RNCR_Msk                        _UINT32_(0x0000FFFF)                                 /* (MCSPI_RNCR) Register Mask  */


/* -------- MCSPI_TNPR : (MCSPI Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define MCSPI_TNPR_TXNPTR_Pos                 _UINT32_(0)                                          /* (MCSPI_TNPR) Transmit Next Pointer Position */
#define MCSPI_TNPR_TXNPTR_Msk                 (_UINT32_(0xFFFFFFFF) << MCSPI_TNPR_TXNPTR_Pos)      /* (MCSPI_TNPR) Transmit Next Pointer Mask */
#define MCSPI_TNPR_TXNPTR(value)              (MCSPI_TNPR_TXNPTR_Msk & (_UINT32_(value) << MCSPI_TNPR_TXNPTR_Pos)) /* Assigment of value for TXNPTR in the MCSPI_TNPR register */
#define MCSPI_TNPR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_TNPR) Register Mask  */


/* -------- MCSPI_TNCR : (MCSPI Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define MCSPI_TNCR_TXNCTR_Pos                 _UINT32_(0)                                          /* (MCSPI_TNCR) Transmit Counter Next Position */
#define MCSPI_TNCR_TXNCTR_Msk                 (_UINT32_(0xFFFF) << MCSPI_TNCR_TXNCTR_Pos)          /* (MCSPI_TNCR) Transmit Counter Next Mask */
#define MCSPI_TNCR_TXNCTR(value)              (MCSPI_TNCR_TXNCTR_Msk & (_UINT32_(value) << MCSPI_TNCR_TXNCTR_Pos)) /* Assigment of value for TXNCTR in the MCSPI_TNCR register */
#define MCSPI_TNCR_Msk                        _UINT32_(0x0000FFFF)                                 /* (MCSPI_TNCR) Register Mask  */


/* -------- MCSPI_PTCR : (MCSPI Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define MCSPI_PTCR_RXTEN_Pos                  _UINT32_(0)                                          /* (MCSPI_PTCR) Receiver Transfer Enable Position */
#define MCSPI_PTCR_RXTEN_Msk                  (_UINT32_(0x1) << MCSPI_PTCR_RXTEN_Pos)              /* (MCSPI_PTCR) Receiver Transfer Enable Mask */
#define MCSPI_PTCR_RXTEN(value)               (MCSPI_PTCR_RXTEN_Msk & (_UINT32_(value) << MCSPI_PTCR_RXTEN_Pos)) /* Assigment of value for RXTEN in the MCSPI_PTCR register */
#define MCSPI_PTCR_RXTDIS_Pos                 _UINT32_(1)                                          /* (MCSPI_PTCR) Receiver Transfer Disable Position */
#define MCSPI_PTCR_RXTDIS_Msk                 (_UINT32_(0x1) << MCSPI_PTCR_RXTDIS_Pos)             /* (MCSPI_PTCR) Receiver Transfer Disable Mask */
#define MCSPI_PTCR_RXTDIS(value)              (MCSPI_PTCR_RXTDIS_Msk & (_UINT32_(value) << MCSPI_PTCR_RXTDIS_Pos)) /* Assigment of value for RXTDIS in the MCSPI_PTCR register */
#define MCSPI_PTCR_TXTEN_Pos                  _UINT32_(8)                                          /* (MCSPI_PTCR) Transmitter Transfer Enable Position */
#define MCSPI_PTCR_TXTEN_Msk                  (_UINT32_(0x1) << MCSPI_PTCR_TXTEN_Pos)              /* (MCSPI_PTCR) Transmitter Transfer Enable Mask */
#define MCSPI_PTCR_TXTEN(value)               (MCSPI_PTCR_TXTEN_Msk & (_UINT32_(value) << MCSPI_PTCR_TXTEN_Pos)) /* Assigment of value for TXTEN in the MCSPI_PTCR register */
#define MCSPI_PTCR_TXTDIS_Pos                 _UINT32_(9)                                          /* (MCSPI_PTCR) Transmitter Transfer Disable Position */
#define MCSPI_PTCR_TXTDIS_Msk                 (_UINT32_(0x1) << MCSPI_PTCR_TXTDIS_Pos)             /* (MCSPI_PTCR) Transmitter Transfer Disable Mask */
#define MCSPI_PTCR_TXTDIS(value)              (MCSPI_PTCR_TXTDIS_Msk & (_UINT32_(value) << MCSPI_PTCR_TXTDIS_Pos)) /* Assigment of value for TXTDIS in the MCSPI_PTCR register */
#define MCSPI_PTCR_RXCBEN_Pos                 _UINT32_(16)                                         /* (MCSPI_PTCR) Receiver Circular Buffer Enable Position */
#define MCSPI_PTCR_RXCBEN_Msk                 (_UINT32_(0x1) << MCSPI_PTCR_RXCBEN_Pos)             /* (MCSPI_PTCR) Receiver Circular Buffer Enable Mask */
#define MCSPI_PTCR_RXCBEN(value)              (MCSPI_PTCR_RXCBEN_Msk & (_UINT32_(value) << MCSPI_PTCR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the MCSPI_PTCR register */
#define MCSPI_PTCR_RXCBDIS_Pos                _UINT32_(17)                                         /* (MCSPI_PTCR) Receiver Circular Buffer Disable Position */
#define MCSPI_PTCR_RXCBDIS_Msk                (_UINT32_(0x1) << MCSPI_PTCR_RXCBDIS_Pos)            /* (MCSPI_PTCR) Receiver Circular Buffer Disable Mask */
#define MCSPI_PTCR_RXCBDIS(value)             (MCSPI_PTCR_RXCBDIS_Msk & (_UINT32_(value) << MCSPI_PTCR_RXCBDIS_Pos)) /* Assigment of value for RXCBDIS in the MCSPI_PTCR register */
#define MCSPI_PTCR_TXCBEN_Pos                 _UINT32_(18)                                         /* (MCSPI_PTCR) Transmitter Circular Buffer Enable Position */
#define MCSPI_PTCR_TXCBEN_Msk                 (_UINT32_(0x1) << MCSPI_PTCR_TXCBEN_Pos)             /* (MCSPI_PTCR) Transmitter Circular Buffer Enable Mask */
#define MCSPI_PTCR_TXCBEN(value)              (MCSPI_PTCR_TXCBEN_Msk & (_UINT32_(value) << MCSPI_PTCR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the MCSPI_PTCR register */
#define MCSPI_PTCR_TXCBDIS_Pos                _UINT32_(19)                                         /* (MCSPI_PTCR) Transmitter Circular Buffer Disable Position */
#define MCSPI_PTCR_TXCBDIS_Msk                (_UINT32_(0x1) << MCSPI_PTCR_TXCBDIS_Pos)            /* (MCSPI_PTCR) Transmitter Circular Buffer Disable Mask */
#define MCSPI_PTCR_TXCBDIS(value)             (MCSPI_PTCR_TXCBDIS_Msk & (_UINT32_(value) << MCSPI_PTCR_TXCBDIS_Pos)) /* Assigment of value for TXCBDIS in the MCSPI_PTCR register */
#define MCSPI_PTCR_ERRCLR_Pos                 _UINT32_(24)                                         /* (MCSPI_PTCR) Transfer Bus Error Clear Position */
#define MCSPI_PTCR_ERRCLR_Msk                 (_UINT32_(0x1) << MCSPI_PTCR_ERRCLR_Pos)             /* (MCSPI_PTCR) Transfer Bus Error Clear Mask */
#define MCSPI_PTCR_ERRCLR(value)              (MCSPI_PTCR_ERRCLR_Msk & (_UINT32_(value) << MCSPI_PTCR_ERRCLR_Pos)) /* Assigment of value for ERRCLR in the MCSPI_PTCR register */
#define MCSPI_PTCR_Msk                        _UINT32_(0x010F0303)                                 /* (MCSPI_PTCR) Register Mask  */


/* -------- MCSPI_PTSR : (MCSPI Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define MCSPI_PTSR_RXTEN_Pos                  _UINT32_(0)                                          /* (MCSPI_PTSR) Receiver Transfer Enable Position */
#define MCSPI_PTSR_RXTEN_Msk                  (_UINT32_(0x1) << MCSPI_PTSR_RXTEN_Pos)              /* (MCSPI_PTSR) Receiver Transfer Enable Mask */
#define MCSPI_PTSR_RXTEN(value)               (MCSPI_PTSR_RXTEN_Msk & (_UINT32_(value) << MCSPI_PTSR_RXTEN_Pos)) /* Assigment of value for RXTEN in the MCSPI_PTSR register */
#define MCSPI_PTSR_TXTEN_Pos                  _UINT32_(8)                                          /* (MCSPI_PTSR) Transmitter Transfer Enable Position */
#define MCSPI_PTSR_TXTEN_Msk                  (_UINT32_(0x1) << MCSPI_PTSR_TXTEN_Pos)              /* (MCSPI_PTSR) Transmitter Transfer Enable Mask */
#define MCSPI_PTSR_TXTEN(value)               (MCSPI_PTSR_TXTEN_Msk & (_UINT32_(value) << MCSPI_PTSR_TXTEN_Pos)) /* Assigment of value for TXTEN in the MCSPI_PTSR register */
#define MCSPI_PTSR_RXCBEN_Pos                 _UINT32_(16)                                         /* (MCSPI_PTSR) Receiver Circular Buffer Enable Position */
#define MCSPI_PTSR_RXCBEN_Msk                 (_UINT32_(0x1) << MCSPI_PTSR_RXCBEN_Pos)             /* (MCSPI_PTSR) Receiver Circular Buffer Enable Mask */
#define MCSPI_PTSR_RXCBEN(value)              (MCSPI_PTSR_RXCBEN_Msk & (_UINT32_(value) << MCSPI_PTSR_RXCBEN_Pos)) /* Assigment of value for RXCBEN in the MCSPI_PTSR register */
#define MCSPI_PTSR_TXCBEN_Pos                 _UINT32_(18)                                         /* (MCSPI_PTSR) Transmitter Circular Buffer Enable Position */
#define MCSPI_PTSR_TXCBEN_Msk                 (_UINT32_(0x1) << MCSPI_PTSR_TXCBEN_Pos)             /* (MCSPI_PTSR) Transmitter Circular Buffer Enable Mask */
#define MCSPI_PTSR_TXCBEN(value)              (MCSPI_PTSR_TXCBEN_Msk & (_UINT32_(value) << MCSPI_PTSR_TXCBEN_Pos)) /* Assigment of value for TXCBEN in the MCSPI_PTSR register */
#define MCSPI_PTSR_ERR_Pos                    _UINT32_(24)                                         /* (MCSPI_PTSR) Transfer Bus Error Position */
#define MCSPI_PTSR_ERR_Msk                    (_UINT32_(0x1) << MCSPI_PTSR_ERR_Pos)                /* (MCSPI_PTSR) Transfer Bus Error Mask */
#define MCSPI_PTSR_ERR(value)                 (MCSPI_PTSR_ERR_Msk & (_UINT32_(value) << MCSPI_PTSR_ERR_Pos)) /* Assigment of value for ERR in the MCSPI_PTSR register */
#define MCSPI_PTSR_Msk                        _UINT32_(0x01050101)                                 /* (MCSPI_PTSR) Register Mask  */


