Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
/* -------- MCSPI_PWPMR : (MCSPI Offset: 0x128) (R/W 32) Write Protection Mode Register -------- */
#define MCSPI_PWPMR_WPPTREN_Pos               _UINT32_(0)                                          /* (MCSPI_PWPMR) Write Protection Pointer Registers Enable Position */
#define MCSPI_PWPMR_WPPTREN_Msk               (_UINT32_(0x1) << MCSPI_PWPMR_WPPTREN_Pos)           /* (MCSPI_PWPMR) Write Protection Pointer Registers Enable Mask */
#define MCSPI_PWPMR_WPPTREN(value)            (MCSPI_PWPMR_WPPTREN_Msk & (_UINT32_(value) << MCSPI_PWPMR_WPPTREN_Pos)) /* Assigment of value for WPPTREN in the MCSPI_PWPMR register */
#define MCSPI_PWPMR_WPCTREN_Pos               _UINT32_(1)                                          /* (MCSPI_PWPMR) Write Protection Counter Registers Enable Position */
#define MCSPI_PWPMR_WPCTREN_Msk               (_UINT32_(0x1) << MCSPI_PWPMR_WPCTREN_Pos)           /* (MCSPI_PWPMR) Write Protection Counter Registers Enable Mask */
#define MCSPI_PWPMR_WPCTREN(value)            (MCSPI_PWPMR_WPCTREN_Msk & (_UINT32_(value) << MCSPI_PWPMR_WPCTREN_Pos)) /* Assigment of value for WPCTREN in the MCSPI_PWPMR register */
#define MCSPI_PWPMR_WPCREN_Pos                _UINT32_(2)                                          /* (MCSPI_PWPMR) Write Protection Control Register Enable Position */
#define MCSPI_PWPMR_WPCREN_Msk                (_UINT32_(0x1) << MCSPI_PWPMR_WPCREN_Pos)            /* (MCSPI_PWPMR) Write Protection Control Register Enable Mask */
#define MCSPI_PWPMR_WPCREN(value)             (MCSPI_PWPMR_WPCREN_Msk & (_UINT32_(value) << MCSPI_PWPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the MCSPI_PWPMR register */
#define MCSPI_PWPMR_WPKEY_Pos                 _UINT32_(8)                                          /* (MCSPI_PWPMR) Write Protection Key Position */
#define MCSPI_PWPMR_WPKEY_Msk                 (_UINT32_(0xFFFFFF) << MCSPI_PWPMR_WPKEY_Pos)        /* (MCSPI_PWPMR) Write Protection Key Mask */
#define MCSPI_PWPMR_WPKEY(value)              (MCSPI_PWPMR_WPKEY_Msk & (_UINT32_(value) << MCSPI_PWPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the MCSPI_PWPMR register */
#define   MCSPI_PWPMR_WPKEY_PASSWD_Val        _UINT32_(0x504443)                                   /* (MCSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0.  */
#define MCSPI_PWPMR_WPKEY_PASSWD              (MCSPI_PWPMR_WPKEY_PASSWD_Val << MCSPI_PWPMR_WPKEY_Pos) /* (MCSPI_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. Position  */
#define MCSPI_PWPMR_Msk                       _UINT32_(0xFFFFFF07)                                 /* (MCSPI_PWPMR) Register Mask  */


/** \brief MCSPI register offsets definitions */
#define MCSPI_CR_REG_OFST              _UINT32_(0x00)      /* (MCSPI_CR) Control Register Offset */
#define MCSPI_MR_REG_OFST              _UINT32_(0x04)      /* (MCSPI_MR) Mode Register Offset */
#define MCSPI_RDR_REG_OFST             _UINT32_(0x08)      /* (MCSPI_RDR) Receive Data Register Offset */
#define MCSPI_TDR_REG_OFST             _UINT32_(0x0C)      /* (MCSPI_TDR) Transmit Data Register Offset */
#define MCSPI_SR_REG_OFST              _UINT32_(0x10)      /* (MCSPI_SR) Status Register Offset */
#define MCSPI_IER_REG_OFST             _UINT32_(0x14)      /* (MCSPI_IER) Interrupt Enable Register Offset */
#define MCSPI_IDR_REG_OFST             _UINT32_(0x18)      /* (MCSPI_IDR) Interrupt Disable Register Offset */
#define MCSPI_IMR_REG_OFST             _UINT32_(0x1C)      /* (MCSPI_IMR) Interrupt Mask Register Offset */
#define MCSPI_CSR_REG_OFST             _UINT32_(0x30)      /* (MCSPI_CSR) Chip Select Register (CS_number = 0) Offset */
#define MCSPI_CSR0_REG_OFST            _UINT32_(0x30)      /* (MCSPI_CSR0) Chip Select Register (CS_number = 0) Offset */
#define MCSPI_CSR1_REG_OFST            _UINT32_(0x34)      /* (MCSPI_CSR1) Chip Select Register (CS_number = 0) Offset */
#define MCSPI_CSR2_REG_OFST            _UINT32_(0x38)      /* (MCSPI_CSR2) Chip Select Register (CS_number = 0) Offset */
#define MCSPI_CSR3_REG_OFST            _UINT32_(0x3C)      /* (MCSPI_CSR3) Chip Select Register (CS_number = 0) Offset */
#define MCSPI_FMR_REG_OFST             _UINT32_(0x40)      /* (MCSPI_FMR) FIFO Mode Register Offset */
#define MCSPI_FLR_REG_OFST             _UINT32_(0x44)      /* (MCSPI_FLR) FIFO Level Register Offset */
#define MCSPI_CMPR_REG_OFST            _UINT32_(0x48)      /* (MCSPI_CMPR) Comparison Register Offset */
#define MCSPI_CRCR_REG_OFST            _UINT32_(0x4C)      /* (MCSPI_CRCR) CRC Register Offset */
#define MCSPI_TPMR_REG_OFST            _UINT32_(0x50)      /* (MCSPI_TPMR) Two-Pin Mode Register Offset */
#define MCSPI_TPHR_REG_OFST            _UINT32_(0x54)      /* (MCSPI_TPHR) Two-Pin Header Register Offset */
#define MCSPI_WPMR_REG_OFST            _UINT32_(0xE4)      /* (MCSPI_WPMR) Write Protection Mode Register Offset */
#define MCSPI_WPSR_REG_OFST            _UINT32_(0xE8)      /* (MCSPI_WPSR) Write Protection Status Register Offset */
#define MCSPI_RPR_REG_OFST             _UINT32_(0x100)     /* (MCSPI_RPR) Receive Pointer Register Offset */
#define MCSPI_RCR_REG_OFST             _UINT32_(0x104)     /* (MCSPI_RCR) Receive Counter Register Offset */
#define MCSPI_TPR_REG_OFST             _UINT32_(0x108)     /* (MCSPI_TPR) Transmit Pointer Register Offset */
#define MCSPI_TCR_REG_OFST             _UINT32_(0x10C)     /* (MCSPI_TCR) Transmit Counter Register Offset */
#define MCSPI_RNPR_REG_OFST            _UINT32_(0x110)     /* (MCSPI_RNPR) Receive Next Pointer Register Offset */
#define MCSPI_RNCR_REG_OFST            _UINT32_(0x114)     /* (MCSPI_RNCR) Receive Next Counter Register Offset */
#define MCSPI_TNPR_REG_OFST            _UINT32_(0x118)     /* (MCSPI_TNPR) Transmit Next Pointer Register Offset */
#define MCSPI_TNCR_REG_OFST            _UINT32_(0x11C)     /* (MCSPI_TNCR) Transmit Next Counter Register Offset */
#define MCSPI_PTCR_REG_OFST            _UINT32_(0x120)     /* (MCSPI_PTCR) Transfer Control Register Offset */
#define MCSPI_PTSR_REG_OFST            _UINT32_(0x124)     /* (MCSPI_PTSR) Transfer Status Register Offset */
#define MCSPI_PWPMR_REG_OFST           _UINT32_(0x128)     /* (MCSPI_PWPMR) Write Protection Mode Register Offset */

