Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/mcspi.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MCSPI register API structure */
typedef struct
{
  __O   uint32_t                       MCSPI_CR;           /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       MCSPI_MR;           /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint32_t                       MCSPI_RDR;          /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O   uint32_t                       MCSPI_TDR;          /**< Offset: 0x0C ( /W  32) Transmit Data Register */
  __I   uint32_t                       MCSPI_SR;           /**< Offset: 0x10 (R/   32) Status Register */
  __O   uint32_t                       MCSPI_IER;          /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       MCSPI_IDR;          /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       MCSPI_IMR;          /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       MCSPI_CSR[4];       /**< Offset: 0x30 (R/W  32) Chip Select Register (CS_number = 0) */
  __IO  uint32_t                       MCSPI_FMR;          /**< Offset: 0x40 (R/W  32) FIFO Mode Register */
  __I   uint32_t                       MCSPI_FLR;          /**< Offset: 0x44 (R/   32) FIFO Level Register */
  __IO  uint32_t                       MCSPI_CMPR;         /**< Offset: 0x48 (R/W  32) Comparison Register */
  __IO  uint32_t                       MCSPI_CRCR;         /**< Offset: 0x4C (R/W  32) CRC Register */
  __IO  uint32_t                       MCSPI_TPMR;         /**< Offset: 0x50 (R/W  32) Two-Pin Mode Register */
  __I   uint32_t                       MCSPI_TPHR;         /**< Offset: 0x54 (R/   32) Two-Pin Header Register */
  __I   uint8_t                        Reserved2[0x8C];
  __IO  uint32_t                       MCSPI_WPMR;         /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       MCSPI_WPSR;         /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved3[0x14];
  __IO  uint32_t                       MCSPI_RPR;          /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO  uint32_t                       MCSPI_RCR;          /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO  uint32_t                       MCSPI_TPR;          /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO  uint32_t                       MCSPI_TCR;          /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO  uint32_t                       MCSPI_RNPR;         /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO  uint32_t                       MCSPI_RNCR;         /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO  uint32_t                       MCSPI_TNPR;         /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO  uint32_t                       MCSPI_TNCR;         /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O   uint32_t                       MCSPI_PTCR;         /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I   uint32_t                       MCSPI_PTSR;         /**< Offset: 0x124 (R/   32) Transfer Status Register */
  __IO  uint32_t                       MCSPI_PWPMR;        /**< Offset: 0x128 (R/W  32) Write Protection Mode Register */
} mcspi_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_MCSPI_COMPONENT_H_ */
